In [50]:
# This Python 3 environment comes with many helpful analytics libraries installed
# It is defined by the kaggle/python Docker image: https://github.com/kaggle/docker-python
# For example, here's several helpful packages to load

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

# Input data files are available in the read-only "../input/" directory
# For example, running this (by clicking run or pressing Shift+Enter) will list all files under the input directory

import os
for dirname, _, filenames in os.walk('/kaggle/input'):
    for filename in filenames:
        print(os.path.join(dirname, filename))

# You can write up to 20GB to the current directory (/kaggle/working/) that gets preserved as output when you create a version using "Save & Run All" 
# You can also write temporary files to /kaggle/temp/, but they won't be saved outside of the current session

/kaggle/input/titanic-dataset-csv/CS379T-Week-1-IP.csv

## Yasmine Dawud
## April 16, 2023
## CS379-2302A-01
## Individual Project 1 - Supervised Machine Learning

In [51]:
#data analysis libraries 
import numpy as np
import pandas as pd

#visualization libraries
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

#ignore warnings
import warnings
warnings.filterwarnings('ignore')

In [52]:
#read CSV
titanic_df = pd.read_csv("/kaggle/input/titanic-dataset-csv/CS379T-Week-1-IP.csv")
titanic_df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [53]:
#Find the number duplicate record
print('titanic_df - Number of duplicate Record:', titanic_df.duplicated().sum())

titanic_df - Number of duplicate Record: 0

In [54]:
#Find the number of null per each columns
print('Columns in titanic_df with null values:\n')
print(titanic_df.isnull().sum())
print("-"*30)

Columns in titanic_df with null values:

pclass          1
survived        1
name            1
sex             1
age           264
sibsp           1
parch           1
ticket          1
fare            2
cabin        1015
embarked        3
boat          824
body         1189
home.dest     565
dtype: int64
------------------------------

In [55]:
print(titanic_df.columns)

Index(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')

In [56]:
titanic_df.sample(5)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
846,3.0,0.0,"Hampe, Mr. Leon",male,20.0,0.0,0.0,345769,9.5000,NaN,S,NaN,NaN,NaN
1301,3.0,0.0,"Youseff, Mr. Gerious",male,45.5,0.0,0.0,2628,7.2250,NaN,C,NaN,312.0,NaN
21,1.0,1.0,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1.0,1.0,11751,52.5542,D35,S,5,NaN,"New York, NY"
970,3.0,1.0,"Lindqvist, Mr. Eino William",male,20.0,1.0,0.0,STON/O 2. 3101285,7.9250,NaN,S,15,NaN,NaN
256,1.0,1.0,"Salomon, Mr. Abraham L",male,NaN,0.0,0.0,111163,26.0000,NaN,S,1,NaN,"New York, NY"

In [57]:
titanic_df.describe(include = "all")

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
count,1309.000000,1309.000000,1309,1309,1046.000000,1309.000000,1309.000000,1309,1308.000000,295,1307,486,121.000000,745
unique,NaN,NaN,1307,2,NaN,NaN,NaN,929,NaN,186,3,27,NaN,369
top,NaN,NaN,"Connolly, Miss. Kate",male,NaN,NaN,NaN,CA. 2343,NaN,C23 C25 C27,S,13,NaN,"New York, NY"
freq,NaN,NaN,2,843,NaN,NaN,NaN,11,NaN,6,914,39,NaN,64
mean,2.294882,0.381971,NaN,NaN,29.881135,0.498854,0.385027,NaN,33.295479,NaN,NaN,NaN,160.809917,NaN
std,0.837836,0.486055,NaN,NaN,14.413500,1.041658,0.865560,NaN,51.758668,NaN,NaN,NaN,97.696922,NaN
min,1.000000,0.000000,NaN,NaN,0.166700,0.000000,0.000000,NaN,0.000000,NaN,NaN,NaN,1.000000,NaN
25%,2.000000,0.000000,NaN,NaN,21.000000,0.000000,0.000000,NaN,7.895800,NaN,NaN,NaN,72.000000,NaN
50%,3.000000,0.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN,NaN,155.000000,NaN
75%,3.000000,1.000000,NaN,NaN,39.000000,1.000000,0.000000,NaN,31.275000,NaN,NaN,NaN,256.000000,NaN
max,3.000000,1.000000,NaN,NaN,80.000000,8.000000,9.000000,NaN,512.329200,NaN,NaN,NaN,328.000000,NaN

In [58]:
print(pd.isnull(titanic_df).sum())

pclass          1
survived        1
name            1
sex             1
age           264
sibsp           1
parch           1
ticket          1
fare            2
cabin        1015
embarked        3
boat          824
body         1189
home.dest     565
dtype: int64

In [59]:
#we'll start off by dropping the Cabin feature since not a lot more useful information can be extracted from it.
titanic_df = titanic_df.drop(['cabin'], axis = 1)
titanic_df = titanic_df.drop(['ticket'], axis = 1)
titanic_df = titanic_df.drop(['name'], axis = 1)

In [60]:
#now we need to fill in the missing values in the Embarked feature
print("Number of people embarking in Southampton (S):")
southampton = titanic_df[titanic_df["embarked"] == "S"].shape[0]
print(southampton)

print("Number of people embarking in Cherbourg (C):")
cherbourg = titanic_df[titanic_df["embarked"] == "C"].shape[0]
print(cherbourg)

print("Number of people embarking in Queenstown (Q):")
queenstown = titanic_df[titanic_df["embarked"] == "Q"].shape[0]
print(queenstown)

Number of people embarking in Southampton (S):
914
Number of people embarking in Cherbourg (C):
270
Number of people embarking in Queenstown (Q):
123

In [61]:
titanic_df = titanic_df.fillna({"embarked":"S"})

In [62]:
#map each Embarked value to a numerical value
embarked_mapping = {"S": 1, "C": 2, "Q": 3}
titanic_df['embarked'] = titanic_df['embarked'].map(embarked_mapping)

titanic_df.head()

,pclass,survived,sex,age,sibsp,parch,fare,embarked,boat,body,home.dest
0,1.0,1.0,female,29.0000,0.0,0.0,211.3375,1,2,NaN,"St Louis, MO"
1,1.0,1.0,male,0.9167,1.0,2.0,151.5500,1,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,female,2.0000,1.0,2.0,151.5500,1,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,male,30.0000,1.0,2.0,151.5500,1,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,female,25.0000,1.0,2.0,151.5500,1,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [86]:
#map each Sex value to a numerical value
sex_mapping = {"male": 0, "female": 1}
titanic_df['sex'] = titanic_df['sex'].map(sex_mapping)

titanic_df.head()

,pclass,survived,sex,age,sibsp,parch,fare,embarked,boat,body,home.dest
0,1.0,1.0,NaN,29.0000,0.0,0.0,211.3375,1,2,NaN,"St Louis, MO"
1,1.0,1.0,NaN,0.9167,1.0,2.0,151.5500,1,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,NaN,2.0000,1.0,2.0,151.5500,1,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,NaN,30.0000,1.0,2.0,151.5500,1,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,NaN,25.0000,1.0,2.0,151.5500,1,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [99]:
X_train = titanic_df.drop("survived", axis=1)
Y_train = titanic_df["sex"]
X_test  = titanic_df.drop("age", axis=1).copy()
X_train.shape, Y_train.shape, X_test.shape

((1310, 10), (1310,), (1310, 10))

In [100]:
#Using LogisticRegression
from sklearn.linear_model import LogisticRegression
model = LogisticRegression()
model.fit(X_train, Y_train)
Y_pred = model.predict(X_test)

from sklearn.metrics import accuracy_score
lras=accuracy_score(Y_test,Y_pred)*100
lras

ValueError: could not convert string to float: 'D'